# StandardHookBendDiameterTooLarge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..StandardHookBendDiameterTooLarge Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Standard Hook Bend Diameter is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StandardHookBendDiameterTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StandardHookBendDiameterTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StandardHookBendDiameterTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace